Revit.AnalysisDisplay.VectorAnalysisDisplay
A Revit Vector Analysis Display

Revit.AnalysisDisplay.VectorAnalysisDisplay.#ctor(Autodesk.Revit.DB.View,Analysis.VectorData,System.String,System.String,System.Type)
Create a Vector Analysis Display in the current view
view:
data:
resultsName:
description:
unitType:

Revit.AnalysisDisplay.VectorAnalysisDisplay.InternalSetSpatialFieldValues(System.Int32,Analysis.VectorData,System.String,System.String,System.Type)
Set the spatial field values for the current spatial field primitive.  The two
input sequences should be of the same length.
data:
schemaName:
description:
unitType:

Revit.AnalysisDisplay.VectorAnalysisDisplay.ByViewPointsAndVectorValues(Revit.Elements.Views.View,Autodesk.DesignScript.Geometry.Point[],Autodesk.DesignScript.Geometry.Vector[],System.String,System.String,System.Type)
Show a Vector Analysis Display in the Revit view.
view: The view into which you want to draw the analysis results.
samplePoints: The locations at which you want to create analysis values.
samples: The analysis values at the given locations.
name: An optional analysis results name to show on the results legend.
description: An optional analysis results description to show on the results legend.
unitType: An optional Unit type to provide conversions in the analysis results.
Returns: A VectorAnalysisDisplay object.

Revit.AnalysisDisplay.VectorAnalysisDisplay.ByViewAndVectorAnalysisData(Revit.Elements.Views.View,Analysis.VectorData,System.String,System.String,System.Type)
Show a Vector Analysis Display in the Revit view.
view: The view into which you want to draw the analysis results.
data: A list of VectorData objects.
name: An optional analysis results name to show on the results legend.
description: An optional analysis results description to show on the results legend.
unitType: An optional Unit type to provide conversions in the analysis results.
Returns: A VectorAnalysisDisplay object.